Tekla Open API Reference for Tekla Structures 2025
LoadUniform Properties
The LoadUniform type exposes the following members.
Properties
Name | Description
AutomaticPrimaryAxisWeight
 The automatic primary axis weight.
 (Inherited from Load.)
BoundingBoxDx
 The dimension of the bounding box in the X direction.
 (Inherited from Load.)
BoundingBoxDy
 The dimension of the bounding box in the Y direction.
 (Inherited from Load.)
BoundingBoxDz
 The dimension of the bounding box in the Z direction.
 (Inherited from Load.)
CreateFixedSupportConditionsAutomatically
 Indicates whether fixed support conditions are created automatically.
 (Inherited from Load.)
DistanceA
 The distance a (for enlarging or reducing the loaded area).
FatherId
 The identifier of the father object that the load is attached to.
 (Inherited from Load.)
Group
 The load group object for the load.
 (Inherited from Load.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LoadAttachment
 The load attachment.
 (Inherited from Load.)
LoadDispersionAngle
 The load dispersion angle.
 (Inherited from Load.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
P1
 The load magnitude vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
PartFilter
 The part filter.
 (Inherited from Load.)
PartNames
 The part names.
 (Inherited from Load.)
Polygon
 The position points for the uniform load.
PrimaryAxisDirection
 The vector for the primary axis direction.
 (Inherited from Load.)
Spanning
 The load spanning.
 (Inherited from Load.)
Weight
 The weight.
 (Inherited from Load.)
Top
See Also
Reference
LoadUniform Class
Tekla.Structures.Model Namespace